satspares/ldmos_design_with_dwin_display/ATmega4808-2026/ATmega4808/lib/SafeStringIO/src/SafeString.h
  createSafeStringFromCharArray(name, char[]);  or cSFA(name, char[]);
   wraps an existing char[] in a SafeString of the given name
  e.g.
  char charBuffer[15];
  createSafeStringFromCharArray(str,charBuffer); or cSFA(str,charBuffer);
  expands in the pre-processor to
   SafeString str(sizeof(charBuffer),charBuffer, charBuffer, "str", true);

  createSafeStringFromCharPtr(name, char*);  or cSFP(name, char*);
   wraps an existing char[] pointed to by char* in a SafeString of the given name
  e.g.
  char charBuffer[15];
  char *bufPtr = charBuffer;
  createSafeStringFromCharPtr(str,bufPtr); or cSFP(str,bufPtr);
  expands in the pre-processor to
   SafeString str((unsigned int)-1,charBuffer, charBuffer, "str", true);
  and the capacity of the SafeString is set to strlen(charBuffer) and cannot be increased.

  createSafeStringFromCharPtrWithSize(name, char*, unsigned int);  or cSFPS(name, char*, unsigned int);
   wraps an existing char[] pointed to by char* in a SafeString of the given name and sets the capacity to the given size -1
  e.g.
  char charBuffer[15];
  char *bufPtr = charBuffer;
  createSafeStringFromCharPtrWithSize(str,bufPtr, 15); or cSFPS(str,bufPtr, 15);
  expands in the pre-processor to
   SafeString str(15,charBuffer, charBuffer, "str", true);
  The capacity of the SafeString is set to 14.

****************************************************************************************/
/*  **************************************************
   If str is a SafeString then
   str = .. works for signed/unsigned ints, char*, char, F(".."), SafeString float, double etc
   str.concat(..) and string.prefix(..) also works for those
   str.stoken(..) can be used to split a string in to tokens

   SafeStrings created via createSafeString(..) or cSF(..) are never invalid, even if called with invalid arguments.
   SafeStrings created via createSafeStringFromCharArray(..) or cSFA(..) are valid as long at the underlying char[] is valid
     Usually the only way the char[] can become invalid is if it exists in a struct that is allocated (via calloc/malloc)
     and then freed while the SafeString wrapping it is still in use.
   SafeStrings created via createSafeStringFromCharPtr(..) or cSFP(..) are valid if the char[] pointed to is validly terminated
   SafeStrings created via createSafeStringFromCharWithSize(..) or cSFPS(..) are valid if the char[] and size specified is valid.
   For both createSafeStringFromCharPtr() and createSafeStringFromCharWithSize()
   the SafeStrings created remain valid as long as the underlying char[] is valid.
     Usually the only way the char[] can become invalid is if it was allocated (via calloc/malloc)
     and then freed while the SafeString wrapping it is still in use.
*  ***************************************************/


#ifdef SSTRING_DEBUG
#define createSafeString(name, size,...) char name ## _SAFEBUFFER[(size)+1]; SafeString name(sizeof(name ## _SAFEBUFFER),name ## _SAFEBUFFER,  ""  __VA_ARGS__ , #name);
#define createSafeStringFromCharArray(name, charArray)  SafeString name(sizeof(charArray),charArray, charArray, #name, true, false);
#define createSafeStringFromCharPtr(name, charPtr) SafeString name((unsigned int)-1,charPtr, charPtr, #name, true);
#define createSafeStringFromCharPtrWithSize(name, charPtr, arraySize) SafeString name((arraySize),charPtr, charPtr, #name, true);
#else
#define createSafeString(name, size,...) char name ## _SAFEBUFFER[(size)+1]; SafeString name(sizeof(name ## _SAFEBUFFER),name ## _SAFEBUFFER, ""  __VA_ARGS__);
#define createSafeStringFromCharArray(name,charArray)  SafeString name(sizeof(charArray),charArray, charArray, NULL, true, false);
#define createSafeStringFromCharPtr(name, charPtr) SafeString name((unsigned int)-1,charPtr, charPtr, NULL, true);
#define createSafeStringFromCharPtrWithSize(name, charPtr, arraySize) SafeString name((arraySize),charPtr, charPtr, NULL, true);
#endif

// define typing shortcuts
#define cSF createSafeString
#define cSFA createSafeStringFromCharArray
#define cSFP createSafeStringFromCharPtr
#define cSFPS createSafeStringFromCharPtrWithSize

/**************
  To create SafeStrings use one of the four (4) macros **createSafeString** or **cSF**, **createSafeStringFromCharArray** or **cSFA**, **createSafeStringFromCharPtr** or **cSFP**, **createSafeStringFromCharPtrWithSize** or **cSFPS** see the detailed description. 
  
  There are four (4) macros used to create SafeStrings.<br> 
  createSafeString(name, size); creates a char[size+1] for you and wraps it in a SafeString called name.<br> 
  createSafeStringFromCharArray(name, char[]); wraps an existing char[] in a SafeString called name.<br> 
  createSafeStringFromCharPtr(name, char*);  wraps an existing char[], pointed to by char*, in a SafeString called name.  The capacity of the SafeString is limited to the initial strlen(char*) and cannot be increased<br> 
  createSafeStringFromCharPtrWithSize(name, char*, size);  wraps an existing char[size], pointed to by char*, in a SafeString called name.<br> 
  
  Each of thise macros has a short hand<br> 
  cSF(name,size) for createSafeString(name, size);<br> 
  cSFA(name,char[]) for createSafeStringFromCharArray(name, char[]);<br> 
  cSFP(name,char*) for createSafeStringFromCharPtr(name, char*);<br> 
  cSFPS(name,char*,size) for createSafeStringFromCharPtrWithSize(name, char*, size);
  
<H1>createSafeString and cSF</H1>  
 createSafeString(name, size) or cSF(name,size)<br>
 and<br>
 <code>createSafeString(name, size, "initialText")</code> or <code>cSF(name,size,"initialText")</code><br>
are utility macros to create a SafeString of a given name and size and optionally, an initial value
  
  createSafeString(str, 40);  or  cSF(str, 40);
expands in the pre-processor to<br>
<code>char str_SAFEBUFFER[40+1];</code><br> 
<code>SafeString str(sizeof(str_SAFEBUFFER),str_SAFEBUFFER,"","str");</code>

  createSafeString(str, 40, "test");  or cSF(str, 40, "test"); 
expands in the pre-processor to<br>
<code>char str_SAFEBUFFER[40+1];</code><br>
<code>SafeString str(sizeof(str_SAFEBUFFER),str_SAFEBUFFER,"test","str");</code>


<H1>createSafeStringFromCharArray and cSFA</H1>  
createSafeStringFromCharArray(name, char[]);  or cSFA(name, char[]);
wraps an existing char[] in a SafeString of the given name. e.g.<br>
<code>char charBuffer[15]; </code><br>
<code>createSafeStringFromCharArray(str,charBuffer); or cSFA(str,charBuffer);</code><br> 
expands in the pre-processor to<br>
<code>SafeString str(sizeof(charBuffer),charBuffer, charBuffer, "str", true);</code><br>
  The capacity of the SafeString is set to 14, from the **sizeof(charBuffer)-1** to allow for the terminating '\0'.


<H1>createSafeStringFromCharPtr and cSFP</H1>  
  createSafeStringFromCharPtr(name, char*);  or cSFP(name, char*);
   wraps an existing char[] pointed to by char* in a SafeString of the given name<br>
  The capacity of the SafeString is set to <code>strlen(charBuffer)</code> and cannot be increased.
   e.g.<br>
<code>char charBuffer[15] = "1234567890";</code><br>
<code>char *bufPtr = charBuffer;</code><br>
<code>createSafeStringFromCharPtr(str,bufPtr); or cSFP(str,bufPtr);</code><br>
  expands in the pre-processor to<br>
<code>SafeString str((unsigned int)-1,charBuffer, charBuffer, "str", true);</code><br>
  The capacity of the SafeString is set to 10, from the **strlen(bufPtr)**

