satspares/ldmos_design_with_dwin_display/ATmega4808-2026/ATmega4808/lib/SafeStringIO/src/SafeString.h
<H1>createSafeStringFromCharPtrWithSize and cSFPS</H1>  
  createSafeStringFromCharPtrWithSize(name, char*, unsigned int size);  or cSFPS(name, char*, unsigned int size);
   wraps an existing char[], pointed to by char*, in a SafeString of the given name<br>
   and sets the capacity to the given unsigned int size e.g.<br>
<code>char charBuffer[15]="1234567890";</code><br>
<code>char *bufPtr = charBuffer;</code><br>
<code>createSafeStringFromCharPtrWithSize(str,bufPtr, 15); or cSFPS(str,bufPtr, 15);</code><br>
  expands in the pre-processor to<br>
<code>SafeString str(15,charBuffer, charBuffer, "str", true);</code><br>
  The capacity of the SafeString is set to 14 from **size-1** to allow for the terminating '\0'.

See [The SafeString alternative to Arduino Strings for Beginners](https://www.forward.com.au/pfod/ArduinoProgramming/SafeString/index.html) for a tutorial.<br>

Also see the example sketches included with the library<br>
SafeString_ConstructorAndDebugging.ino, SafeStringFromCharArray.ino, SafeStringFromCharPtr.ino and SafeStringFromCharPtrWithSize.ino

  
****************************************************************************************/
class SafeString : public Printable, public Print {

  public:
/*********************************************
  SafeString Constructor called from <a href="#details">the four (4) macros</a> **createSafeString** or **cSF**, **createSafeStringFromCharArray** or **cSFA**, **createSafeStringFromCharPtr** or **cSFP**, **createSafeStringFromCharPtrWithSize** or **cSFPS**.
  
  This constructor is not designed to called directly by your code. See the <a href="#details">detailed SafeString class description</a> above.
  @param maxLen - the number of chars that can stored not including the terminating '\0'
  @param buf - the fixed sized char buffer to hold the data
  @param cstr - the initial data to be loaded into this SafeString
  @param _name - the code variable name of this SafeString, default NULL
  @param _fromBuffer - true if this SafeString is wrapping an existing char[]
  @param _fromPtr - true if this SafeString's buf parameter was a char* rather then a char[], _fromPtr is not checked unless _fromBuffer is true
 ********************************************/
// In all cases when maxlen != -1, it is the actual size of the array
// if _fromBuffer false (i.e. cSF(sfStr,20); ) then maxLen is the capacity+1 and the macro allocates an char[20+1], (_fromPtr ignored)
// if _fromBuffer true and _fromPtr false (i.e. cSFA(sfStr, strArray); ) then maxLen is the sizeof the strArray and the capacity is maxLen-1, _fromPtr is false
// if _fromBuffer true and _fromPtr true, then from char*, (i.e. cSFP(sfStr,strPtr) or cSFPS(sfStr,strPtr, maxLen) and maxLen is either -1 cSFP( ) the size of the char Array pointed cSFPS 
//    if maxLen == -1 then capacity == strlen(char*)  i.e. cSFP( )
//    else capacity == maxLen-1;   i.e. cSFPS( )
    explicit SafeString(unsigned int maxLen, char *buf, const char* cstr, const char* _name = NULL, bool _fromBuffer = false, bool _fromPtr = true);
    // _fromBuffer true does extra checking before each method execution for SafeStrings created from existing char[] buffers
    // _fromPtr is not checked unless _fromBuffer is true
    // _fromPtr true allows for any array size, if false prevents passing char* by checking sizeof(charArray) != sizeof(char*)

  private: // to force compile errors if function definition of the SafeString argument is not a refernce, i.e. not SafeString&
    SafeString(const SafeString& other ); // You must declare SafeStrings function arguments as a reference, SafeString&,  e.g. void test(SafeString& strIn)
    // NO other constructors, NO conversion constructors

  public:
    /*****************
     Turns on Error msgs and debug( ) output for all SafeStrings.
     
     This also sets output for the debug( ) method.
     @param debugOut - where to send the messages to, usually Serial, e.g. SafeString::setOutput(Serial);
     @param verbose - optional, if missing defaults to true, use false for compact error messages or call setVerbose(false)
    ***************/    
    static void setOutput(Print& debugOut, bool verbose = true);
    // static SafeString::DebugPrint Output;  // a Print object controlled by setOutput() / turnOutputOff() is defined at the bottom

    /*****************
     Turns off all debugging messages, both error messages AND debug() method output.
     
     Errors are still detected and flagged.
    ***************/    
    static void turnOutputOff(void);     // call this to turn all debugging OFF, both error messages AND debug( ) method output

    // use this to control error messages verbose output
    /*****************
     Controls size of error messages, setOutput sets verbose to true
     
     @param verbose - true for detailed error messages, else short error messages.
    ***************/    
    static void setVerbose(bool verbose); // turn verbose error msgs on/off.  setOutput( ) sets verbose to true

    // returns true if error detected, errors are detected even is setOutput has not been called
    // each call to hasError() clears the errorFlag
    /*****************
     Returns non-zero if any error detected for this SafeString, each call clears the internal flag
    ***************/    
    unsigned char hasError();

    // returns true if error detected in any SafeString object, errors are detected even is setOutput has not been called
    // each call to errorDetected() clears the classErrorFlag
    /*****************
     Returns non-zero if any SafeString has detected and error, each call clears the internal global static flag
    ***************/    
    static unsigned char errorDetected();

    // these methods print out info on this SafeString object, iff setOutput has been called
    // setVerbose( ) does NOT effect these methods which have their own verbose argument
    // Each of these debug( ) methods defaults to outputing the string contents.  Set the optional verbose argument to false to suppress outputing string contents
    // NOTE!! all these debug methods return a pointer to an empty string.
    // This is so that if you add .debug() to Serial.println(str);  i.e. Serial.println(str.debug()) will work as expected
    /*****************
     Output the details about the this SafeString to the output specified by setOutput().
     
     @param verbose - true for detailed output including current contents
    ***************/    
    const char* debug(bool verbose = true);
    
    /*****************
     Output the details about the this SafeString to the output specified by setOutput().
     
     @param title - the title to preceed the debug output, a space between this and the debug output
     @param verbose - true for detailed output including current contents
    ***************/    
    const char* debug(const char* title, bool verbose = true);

    /*****************
     Output the details about the this SafeString to the output specified by setOutput().
     
     @param title - the title to preceed the debug output, a space between this and the debug output
     @param verbose - true for detailed output including current contents
    ***************/    
    const char* debug(const __FlashStringHelper *title, bool verbose = true);

    /*****************
     Output the details about the this SafeString to the output specified by setOutput().
     
     @param title - the title to preceed the debug output, a space between this and the debug output
     @param verbose - true for detailed output including current contents
    ***************/    
    const char* debug(SafeString &stitle, bool verbose = true);

    /*****************
     Write (concatinate) a byte to this SafeString, from Print class.
     
     '\0' bytes are not allowed and will not be added to the SafeString and will raise an error.
     
     @param b - the byte to concatinate to this SafeString
    ***************/    
    virtual size_t write(uint8_t b);
    // writes at most length chars to this SafeString,
    // NOTE: write(cstr,length) will set hasError and optionally output errorMsg, if strlen(cstr) < length and nothing will be added to the SafeString
    
    /*****************
     Write (concatinate) bytes to this SafeString, from Print class.
     
     '\0' bytes are not allowed and will be skipped over and will raise an error.
     
     @param buffer - bytes to concatinate to this SafeString
     @param length - number of bytes to concatinate 
    ***************/    
    virtual size_t write(const uint8_t *buffer, size_t length);

    /*****************
     Implements the Printable interface
     
     @param p - where to print to
    ***************/    
    size_t printTo(Print& p) const;

    // reserve returns 0 if _capacity < size
    /*****************
     Checks there is enough free space in this SafeString for the current operation
     
     @param size - total number of chars that will be in the SafeString if the operation completes
    ***************/    
    unsigned char reserve(unsigned int size);

    /*****************
     Number of characters current in the SafeString, excluding the terminating '\0'
    ***************/    
    unsigned int length(void);
    
    /*****************
     The maximum number of characters this SafeString can hold, excluding the terminating '\0'
    ***************/    
    unsigned int capacity(void);
    
    /*****************
     Returns non-zero if the SafeString is full
    ***************/    
    unsigned char isFull(void);
    
    /*****************
     Returns non-zero if the SafeString is empty
    ***************/    
    unsigned char isEmpty(void);
    
    /*****************
     Returns the number chars that can be added to this SafeString before it is full
    ***************/    
    int availableForWrite(void);

    /*****************
     Empties this SafeString.
     
      returns the current SafeString so you can cascade calls e.g.<br>
      <code>sfStr.clear().concat("New output");</code><br>
    ***************/    
    SafeString & clear(void);

