satspares/ldmos_design_with_dwin_display/ATmega4808-2026/ATmega4808/lib/SafeStringIO/src/SafeString.h
  public:
    // support for print
    size_t print(unsigned char, int = DEC);
    size_t print(int, int = DEC);
    size_t print(unsigned int, int = DEC);
    size_t print(long, int = DEC);
    size_t print(unsigned long, int = DEC);
    size_t print(int64_t, int = DEC);
    size_t print(double, int = 2);
    size_t print(const __FlashStringHelper *);
    size_t print(const char*);
    size_t print(char);
    size_t print(SafeString &str);

    size_t println(unsigned char, int = DEC);
    size_t println(int, int = DEC);
    size_t println(unsigned int, int = DEC);
    size_t println(long, int = DEC);
    size_t println(unsigned long, int = DEC);
    size_t println(int64_t, int = DEC);
    size_t println(double, int = 2);
    size_t println(const __FlashStringHelper *);
    size_t println(const char*);
    size_t println(char);
    size_t println(SafeString &str);
    size_t println(void);
    
    // ********** special prints padding and formatting doubles (longs) **************
    // print to SafeString a double (or long) with decs after the decimal point and padd to specified width
    //    width is a signed value, negative for left adjustment, +ve for right padding
    //    by default the + sign is not added, set forceSign argument to true to force the display of the + sign
    //    
    //    If the result exceeds abs(width), reduce the decs after the decmial point to fit into width
    //    If result with decs reduced to 0 is still > abs(width) raise an error and ,optionally, output an error msg
    //
    //    Note decs is quietly limited in this method to < 7 digit after the decimal point.
    
    /*************************************************************
    Prints a double (or long/int) to this SafeString padded with spaces (left or right) and limited to the specified width and adds a trailing CR NL
    
    This methods can also be used for ints and longs by passing 0 for the decs.
    
    @param d - the double to convert to text
    @param decs - the preferred number of decimial places to output (limited to <7).  This will be reduced automatically to fit the fixed width
    @param width - fixed width the output is to padded/limited to (+ve width padds on left, -ve width padds on right)
    @param forceSign - optional, defaults to false, if true the + sign is added for +ve numbers
    ****************************************************************************/
    size_t println(double d, int decs, int width, bool forceSign = false);
    
    /*************************************************************
    Prints a double (or long/int) to this SafeString padded with spaces (left or right) and limited to the specified width.
    
    This methods can also be used for ints and longs by passing 0 for the decs.
    
    @param d - the double to convert to text
    @param decs - the preferred number of decimial places to output(limited to <7).  This will be reduced automatically to fit the fixed width
    @param width - fixed width the output is to padded/limited to (+ve width padds on left, -ve width padds on right)
    @param forceSign - optional, defaults to false, if true the + sign is added for +ve numbers
    ****************************************************************************/
    size_t print(double d, int decs, int width, bool forceSign = false);



    // Assignment operators **********************************
    //  Set the SafeString to a char version of the assigned value.
    //  For = (const char *) the contents are copied to the SafeString buffer
    //  if the value is null or invalid,
    //  or too large to be fit in the string's internal buffer
    //  the string will be left empty
    
    /*************************************************************
    Clears this SafeString and concatinates a single char.
    
    If the value is null or invalid, or too large to be fit in the string's internal buffer the resulting SafeString will be empty
    
    @param c - the char
    ****************************************************************************/
    SafeString & operator = (char c);
    
    /*************************************************************
    Clears this SafeString and concatinates the text version of the argument
    
    If the value is null or invalid, or too large to be fit in the string's internal buffer the resulting SafeString will be empty
    
    @param num - the number to convert to text
    ****************************************************************************/
    SafeString & operator = (unsigned char num);
    
    /*************************************************************
    Clears this SafeString and concatinates the text version of the argument
    
    If the value is null or invalid, or too large to be fit in the string's internal buffer the resulting SafeString will be empty
    
    @param num - the number to convert to text
    ****************************************************************************/
    SafeString & operator = (int num);

    /*************************************************************
    Clears this SafeString and concatinates the text version of the argument
    
    If the value is null or invalid, or too large to be fit in the string's internal buffer the resulting SafeString will be empty
    
    @param num - the number to convert to text
    ****************************************************************************/
    SafeString & operator = (unsigned int num);

    /*************************************************************
    Clears this SafeString and concatinates the text version of the argument
    
    If the value is null or invalid, or too large to be fit in the string's internal buffer the resulting SafeString will be empty
    
    @param num - the number to convert to text
    ****************************************************************************/
    SafeString & operator = (long num);

