satspares/ldmos_design_with_dwin_display/ATmega4808-2026/ATmega4808/lib/SafeStringIO/src/SafeString.h
    /*************************************************************
    Clears this SafeString and concatinates the text version of the argument
    
    If the value is null or invalid, or too large to be fit in the string's internal buffer the resulting SafeString will be empty
    
    @param num - the number to convert to text
    ****************************************************************************/
    SafeString & operator = (unsigned long num);

    /*************************************************************
    Clears this SafeString and concatinates the text version of the argument
    
    If the value is null or invalid, or too large to be fit in the string's internal buffer the resulting SafeString will be empty
    
    @param num - the number to convert to text
    ****************************************************************************/
    SafeString & operator = (int64_t num);
    
    /*************************************************************
    Clears this SafeString and concatinates the text version of the argument
    
    If the value is null or invalid, or too large to be fit in the string's internal buffer the resulting SafeString will be empty
    
    @param num - the number to convert to text
    ****************************************************************************/
    SafeString & operator = (float num);

    /*************************************************************
    Clears this SafeString and concatinates the text version of the argument
    
    If the value is null or invalid, or too large to be fit in the string's internal buffer the resulting SafeString will be empty
    
    @param num - the number to convert to text
    ****************************************************************************/
    SafeString & operator = (double num);

    /*************************************************************
    Clears this SafeString and copies and concatinates the contents of the argument
    
    If the value is null or invalid, or too large to be fit in the string's internal buffer the resulting SafeString will be empty
    
    @param sfStr - the SafeString to assign
    ****************************************************************************/
    SafeString & operator = (SafeString &sfStr);

    /*************************************************************
    Clears this SafeString and copies and concatinates the contents of the argument
    
    If the value is null or invalid, or too large to be fit in the string's internal buffer the resulting SafeString will be empty
    
    @param cstr - the '\0' terminated char string to assign
    ****************************************************************************/
    SafeString & operator = (const char *cstr);

    /*************************************************************
    Clears this SafeString and copies and concatinates the contents of the argument
    
    If the value is null or invalid, or too large to be fit in the string's internal buffer the resulting SafeString will be empty
    
    @param pstr - the '\0' terminated F("..") string to assign
    ****************************************************************************/
    SafeString & operator = (const __FlashStringHelper *pstr); // handle F(" .. ") values

    /********
      prefix methods add to the front of the current SafeString.
      
      returns the current SafeString so you can cascade calls, e.g.<br>
      <code>sfStr.prefix(2).prefix("first");</code><br>
      If there's not enough memory for the to add prefix, the SafeString will be left unchanged<br>
      If the argument is null or invalid, the prefix is considered unsucessful.
    **/
    SafeString & prefix(SafeString &s);
    SafeString & prefix(const char *cstr);
    SafeString & prefix(char c);
    SafeString & prefix(unsigned char c);
    SafeString & prefix(int num);
    SafeString & prefix(unsigned int num);
    SafeString & prefix(long num);
    SafeString & prefix(unsigned long num);
    SafeString & prefix(int64_t num);
    SafeString & prefix(float num);
    SafeString & prefix(double num);
    SafeString & prefix(const __FlashStringHelper * str);
    SafeString & prefix(const char *cstr, size_t length);
    SafeString & prefix(const __FlashStringHelper * str, size_t length);

    /*******
      concat methods add to the end of the current SafeString.
      
      returns the current SafeString so you can cascade calls e.g.<br>
      <code>sfStr.concat(1).concat("second");</code><br>
      If there's not enough memory for the concatenated value, the SafeString will be left unchanged.<br>
      If the argument is null or invalid, the concatenation is considered unsucessful.
    **/
    SafeString & concat(SafeString &str);
    SafeString & concat(const char *cstr);
    SafeString & concat(char c);
    SafeString & concat(unsigned char c);
    SafeString & concat(int num);
    SafeString & concat(unsigned int num);
    SafeString & concat(long num);
    SafeString & concat(unsigned long num);
    SafeString & concat(int64_t num);
    SafeString & concat(float num);
    SafeString & concat(double num);
    SafeString & concat(const __FlashStringHelper * str);
    // ------------------------------------------------------
    // no corresponding methods these three (3) in  prefix, +=, -+
    
    SafeString & concat(const char *cstr, size_t length); // concat at most length chars from cstr
    // NOTE: concat(cstr,length) will set hasError and optionally output errorMsg, if strlen(cstr) < length and nothing will be concatinated.
    
    SafeString & concat(const __FlashStringHelper * str, size_t length); // concat at most length chars
    
    /******
      Adds \\r\\n to this SafeString.
      returns the current SafeString so you can cascade calls e.g.<br>
      <code>sfStr.newline().concat("next line");</code><br>
    *****/
      SafeString & newline(); // append newline \r\n same as concat("\r\n"); same a println()
    // e.g. sfStr.concat("test").newline();

