satspares/ldmos_design_with_dwin_display/ATmega4808-2026/ATmega4808/lib/SafeStringIO/src/SafeString.h
    /* prefix() operator  -=  ******************
      Operator version of prefix( )
      prefix  -=
      To cascade operators use ( )
      e.g. (sfStr -= 'a') -= 5;
     **/
     /***
       -= operator prefixes the SafeString.
       e.g.<br>
       <code> sfStr -= "top";</code><br>
       gives the same SafeString as<br>
       <code> sfStr.prefix("top");<code><br>
     **/  
    SafeString & operator -= (SafeString &rhs) {
      return prefix(rhs);
    }
    SafeString & operator -= (const char *cstr) {
      return prefix(cstr);
    }
    SafeString & operator -= (char c) {
      return prefix(c);
    }
    SafeString & operator -= (unsigned char num) {
      return prefix(num);
    }
    SafeString & operator -= (int num) {
      return prefix(num);
    }
    SafeString & operator -= (unsigned int num) {
      return prefix(num);
    }
    SafeString & operator -= (long num)  {
      return prefix(num);
    }
    SafeString & operator -= (unsigned long num) {
      return prefix(num);
    }
    SafeString & operator -= (int64_t num) {
      return prefix(num);
    }
    SafeString & operator -= (float num) {
      return prefix(num);
    }
    SafeString & operator -= (double num) {
      return prefix(num);
    }
    SafeString & operator -= (const __FlashStringHelper *str) {
      return prefix(str);
    }

    /* concat() operator  +=  ******************
      Operator versions of concat( )
      suffix/append +=
      To cascade operators use ( )
      e.g. (sfStr += 'a') += 5;
     **/
     /***
       += operator concatinate to the SafeString.
       e.g.<br>
       <code> sfStr += "end";</code><br>
       gives the same SafeString as<br>
       <code> sfStr.concat("end");<code><br>
     **/  
    SafeString & operator += (SafeString &rhs)  {
      return concat(rhs);
    }
    SafeString & operator += (const char *cstr) {
      return concat(cstr);
    }
    SafeString & operator += (char c) {
      return concat(c);
    }
    SafeString & operator += (unsigned char num) {
      return concat(num);
    }
    SafeString & operator += (int num) {
      return concat(num);
    }
    SafeString & operator += (unsigned int num) {
      return concat(num);
    }
    SafeString & operator += (long num) {
      return concat(num);
    }
    SafeString & operator += (unsigned long num) {
      return concat(num);
    }
    SafeString & operator += (int64_t num) {
      return concat(num);
    }
    SafeString & operator += (float num) {
      return concat(num);
    }
    SafeString & operator += (double num)  {
      return concat(num);
    }
    SafeString & operator += (const __FlashStringHelper *str) {
      return concat(str);
    }

    /* Comparision methods and operators  ******************
      comparisons only work with SafeStrings and "strings"
      These methods used to be  ... const {
      but now with createSafeStringFromBuffer( ) the SafeString may be modified by cleanUp()
     **/
     /***
       returns -1 if this SafeString is < s, 0 if this SafeString == s and +1 if this SafeString > s
     **/
    int compareTo(SafeString &s) ;
     /***
       returns -1 if this SafeString is < cstr, 0 if this SafeString == cstr and +1 if this SafeString > cst
     **/
    int compareTo(const char *cstr) ;
    
    unsigned char equals(SafeString &s) ;
    unsigned char equals(const char *cstr) ;
    unsigned char equals(const char c) ;
    unsigned char operator == (SafeString &rhs) {
      return equals(rhs);
    }
    unsigned char operator == (const char *cstr) {
      return equals(cstr);
    }
    unsigned char operator == (const char c) {
      return equals(c);
    }
    unsigned char operator != (SafeString &rhs) {
      return !equals(rhs);
    }
    unsigned char operator != (const char *cstr) {
      return !equals(cstr);
    }
    unsigned char operator != (const char c) {
      return !equals(c);
    }
    unsigned char operator <  (SafeString &rhs) {
      return compareTo(rhs) < 0;
    }
    unsigned char operator >  (SafeString &rhs) {
      return compareTo(rhs) > 0;
    }
    unsigned char operator <= (SafeString &rhs) {
      return compareTo(rhs) <= 0;
    }
    unsigned char operator >= (SafeString &rhs) {
      return compareTo(rhs) >= 0;
    }
    unsigned char operator <  (const char* rhs) {
      return compareTo(rhs) < 0;
    }
    unsigned char operator >  (const char* rhs) {
      return compareTo(rhs) > 0;
    }
    unsigned char operator <= (const char* rhs) {
      return compareTo(rhs) <= 0;
    }
    unsigned char operator >= (const char* rhs) {
      return compareTo(rhs) >= 0;
    }
    unsigned char equalsIgnoreCase(SafeString &s) ;
    unsigned char equalsIgnoreCase(const char *str2) ;
    
    unsigned char equalsConstantTime(SafeString &s) ;

    /* startsWith methods  *******************
      The fromIndex is offset into this SafeString where check is to start
      0 to length() and (unsigned int)(-1) are valid for fromIndex, if fromIndex == length() or -1 false is returned
      if the argument is null or fromIndex > length(), an error is flagged and false returned
    **/
    /** 
      returns non-zero of this SafeString starts this argument looking from fromIndex onwards.
      
      @param c -- char to check for
      @param fromIndex -- where in the SafeString to start looking, default 0, that is start from beginning
    **/
    unsigned char startsWith(const char c, unsigned int fromIndex = 0);
    /** 
      returns non-zero of this SafeString starts this argument looking from fromIndex onwards.
      
      @param str -- string to check for
      @param fromIndex -- where in the SafeString to start looking, default 0, that is start from beginning
    **/
    unsigned char startsWith( const char *str2, unsigned int fromIndex = 0) ;
    /** 
      returns non-zero of this SafeString starts this argument looking from fromIndex onwards.
      
      @param s -- the SafeString to check for
      @param fromIndex -- where in the SafeString to start looking, default 0, that is start from beginning
    **/
    unsigned char startsWith(SafeString &s2, unsigned int fromIndex = 0) ;
    
    /** 
      returns non-zero of this SafeString starts this argument, ignoring case, looking from fromIndex onwards.
      
      @param c -- char to check for, ignoring case
      @param fromIndex -- where in the SafeString to start looking, default 0, that is start from beginning
    **/
    unsigned char startsWithIgnoreCase(const char c, unsigned int fromIndex = 0);
    /** 
      returns non-zero of this SafeString starts this argument, ignoring case, looking from fromIndex onwards.
      
      @param str -- string to check for, ignoring case
      @param fromIndex -- where in the SafeString to start looking, default 0, that is start from beginning
    **/
    unsigned char startsWithIgnoreCase( const char *str2, unsigned int fromIndex = 0) ;
    /** 
      returns non-zero of this SafeString starts this argument, ignoring case, looking from fromIndex onwards.
      
      @param s -- SafeString to check for, ignoring case
      @param fromIndex -- where in the SafeString to start looking, default 0, that is start from beginning
    **/
    unsigned char startsWithIgnoreCase( SafeString &s2, unsigned int fromIndex = 0) ;
    
    /* endsWith methods  *******************/
    /** 
      returns non-zero of this SafeString ends with the argument
      
      @param c -- the char to check for
    **/
    unsigned char endsWith(const char c);
    /** 
      returns non-zero of this SafeString ends with the argument
      
      @param suffix -- SafeString to check for
    **/
    unsigned char endsWith(SafeString &suffix) ;
    /** 
      returns non-zero of this SafeString ends with the argument
      
