satspares/ldmos_design_with_dwin_display/ATmega4808-2026/ATmega4808/lib/SafeStringIO/src/SafeString.h
      @param suffix -- string to check for
    **/
    unsigned char endsWith(const char *suffix) ;
    /** 
      returns non-zero of this SafeString ends any one of the chars in the argument
      
      @param suffix -- the SafeString containing the chars to check for
    **/
    unsigned char endsWithCharFrom(SafeString &suffix) ;
    /** 
      returns non-zero of this SafeString ends any one of the chars in the argument
      
      @param suffix -- the string containing the chars to check for
    **/
    unsigned char endsWithCharFrom(const char *suffix) ;

    /* character acccess methods  *******************
      NOTE: There is no access to modify the underlying char buffer directly
      For these methods 0 to length()-1 is valid for index
      index greater than length() -1 will return 0 and set the error flag and will print errors if debug enabled
    **/
    /**
      returns the char at that location in this SafeString.
      
      @param index - the zero based index of the char to return.<br>
       
      @return the char at that index OR if index >= length() return 0 and raise error 
      **/
    char charAt(unsigned int index) ; // if index >= length() returns 0 and prints a error msg
    /**
      returns the char at that location in this SafeString.
      
      @param index - the zero based index of the char to return.<br>
       
      @return the char at that index OR if index >= length() return 0 and raise error 
      **/
    char operator [] (unsigned int index) ; // if index >= length() returns 0 and prints a error msg

    // setting a char in the SafeString
    // str[..] = c;  is not supported because it allows direct access to modify the underlying char buffer
    /**
      sets the char at that location in this SafeString.
      
      @param index - the zero based index of the char to return.<br>
      @param c - the char to set at that index. '\\0' chars are ignored and an error raised.
      **/
    void setCharAt(unsigned int index, char c); //if index >= length() the error flag is set
    // calls to setCharAt(length(), ..) and  setCharAt(.. , '\0') are ignored and error flag is set

    // returning the underlying buffer
    // returned as a const and should not be changesdor recast to a non-const
    /**
      returns a const char* to the underlying char[ ] in this SafeString.
      <b>Do not make changes this char[ ]</b>
      **/
    const char* c_str();


    /* search methods  *******************
       Arrays are indexed by a unsigned int variable
       See the SafeStringIndexOf.ino example sketch
      All indexOf methods return -1 if not found
    **********************************************/
    // The fromIndex is offset into this SafeString where to start searching (inclusive)
    // 0 to length() and -1 is valid for fromIndex
    // if fromIndex > length(), than the error flag is set and -1 returned and prints an error if debug enabled
    // if fromIndex == (unsigned int)(-1) -1 is returned without error.
    /*
      returns the index
    */
    //int indexOf( char ch ) ;
    /**
      returns the index of the char, searching from fromIndex.
      @param ch - the char to search for
      @param fromIndex - where to start the search from, default 0, that is from begining<br> if fromIndex > length() raise an error<br> if fromIndex == -1 OR fromIndex == length(), return -1 without error
        
      @return -1 if not found, else the index in the range 0 to length()-1
      */
    int indexOf( char ch, unsigned int fromIndex = 0) ;
    //int indexOf( SafeString & str ) ;
    //int indexOf( const char* str ) ;
    /**
      returns the index of the string, searching from fromIndex.
      @param str - the string to search for
      @param fromIndex - where to start the search from, default 0, that is from begining<br> if fromIndex > length() raise an error<br> if fromIndex == -1 OR fromIndex == length(), return -1 without error
      @return -1 if not found, else the index in the range 0 to length()-1
      */
    int indexOf(const char* str , unsigned int fromIndex = 0) ;
    /**
      returns the index of the SafeString, searching from fromIndex.
      @param str - the SafeString to search for
      @param fromIndex - where to start the search from, default 0, that is from begining<br> if fromIndex > length() raise an error<br> if fromIndex == -1 OR fromIndex == length(), return -1 without error
      @return -1 if not found, else the index in the range 0 to length()-1
      */
    int indexOf( SafeString & str, unsigned int fromIndex = 0 ) ;

    /**
      returns the last index of the char, searching backwards from fromIndex (inclusive).
      @param c - the char to search for
      @return -1 if not found, else the index in the range 0 to length()-1
      */
    int lastIndexOf( char ch ) ;

    /**
      returns the last index of the char, searching backwards from fromIndex (inclusive).
      @param c - the char to search for
      @param fromIndex - where to start searching backwards from,<br> if fromIndex > length() raise an error<br> if fromIndex == -1 OR fromIndex == length(), return -1 without error
      @return -1 if not found, else the index in the range 0 to length()-1
      */
    int lastIndexOf( char ch, unsigned int fromIndex) ;

    /**
      returns the last index of the arguement, searching backwards from fromIndex (inclusive).
      @param str - the SafeString to search for
      @return -1 if not found, else the index in the range 0 to length()-1
      */
    int lastIndexOf( SafeString & str ) ;
    /**
      returns the last index of the char, searching backwards from fromIndex (inclusive).
      @param str - the SafeString to search for
      @param fromIndex - where to start searching backwards from,<br> if fromIndex > length() raise an error<br> if fromIndex == -1 OR fromIndex == length(), return -1 without error
      @return -1 if not found, else the index in the range 0 to length()-1
      */
    int lastIndexOf( SafeString & str, unsigned int fromIndex) ;

    /**
      returns the last index of the arguement, searching backwards from fromIndex (inclusive).
      @param cstr - the string to search for
      @return -1 if not found, else the index in the range 0 to length()-1
      */
    int lastIndexOf( const char *cstr ) ;

    /**
      returns the last index of the char, searching backwards from fromIndex (inclusive).
      @param cstr - the string to search for
      @param fromIndex - where to start searching backwards from,<br> if fromIndex > length() raise an error<br> if fromIndex == -1 OR fromIndex == length(), return -1 without error
      @return -1 if not found, else the index in the range 0 to length()-1
      */
    int lastIndexOf(const char* cstr, unsigned int fromIndex);
    
