satspares/ldmos_design_with_dwin_display/ATmega4808-2026/ATmega4808/lib/SafeStringIO/src/SafeString.h
    /* *** SafeString modification methods ************/

    /* *** replace ************/
    /**
      replace the findChar with the replaceChar
      @param findChar - the char to be replaced
      @param replaceChar - the char to replace it
      */
    void replace(char findChar, char replaceChar);

    /**
      replace the findChar with the replace string
      @param findChar - the char to be replaced
      @param replaceStr - the string to replace it
      */
    void replace(const char findChar, const char *replaceStr);

    /**
      replace the findChar with the sfReplace SafeString contents
      @param findChar - the char to be replaced
      @param sfReplace - the SafeString whose contents will replace it
      */
    void replace(const char findChar, SafeString& sfReplace);

    /**
      replace the findStr string with the replace string
      @param findStr - the string to be replaced
      @param replaceStr - the string to replace it
      */
    void replace(const char* findStr, const char *replaceStr);

    /**
      replace the occurances of the sfFind string, with the sfReplace SafeString contents
      @param sfFind - the SafeString containing the string of chars to be replaced
      @param sfReplace - the SafeString whose contents will replace it
      */
    void replace(SafeString & sfFind, SafeString & sfReplace);

    /* *** remove ************/
    // remove from index to end of SafeString
    // 0 to length() and (unsigned int)(-1) are valid for index,
    // -1 => length() for processing and just returns without error
    /**
      remove all chars from startIndex to the end of the SafeString (inclusive)
      @param startIndex - the index of the first char to be removed<br>
      Valid startIndex is 0 to length(), and -1 which is treated as length()<br>
      Other startIndex raise an error.
      */
    void removeFrom(unsigned int startIndex);

    // remove from 0 to startIdx (excluding startIdx)
    // 0 to length() and (unsigned int)(-1) are valid for index,
    // -1 => length() for processing
    /**
      remove all chars from 0 to startIndex (exclusive), that is the char at startIndex is NOT removed
      @param startIndex - the index of the first char NOT to be removed<br>
      Valid startIndex is 0 to length(), and -1 which is treated as length()<br>
      Other startIndex raise an error.
      */
    void removeBefore(unsigned int startIndex);

    // remove from index to end of SafeString
    // 0 to length() and (unsigned int)(-1) are valid for index,
    // -1 => length() for processing and just returns without error
    /**
      remove all chars from index to the end of the SafeString (inclusive)
      @param index - the index of the first char to be removed<br>
      Valid index is 0 to length(), and -1 which is treated as length()<br>
      Other index raise an error.
      */
    void remove(unsigned int index);

    // remove count chars starting from index
    // 0 to length() and unsigned int(-1) are valid for index
    // -1 just returns without error
    // 0 to (length()- index) is valid for count, larger values set the error flag and remove from idx to end of string
    /**
      remove count chars starting from index
      @param index - the index of the first char to be removed<br>
      Valid index is 0 to length(), and -1 which is treated as length()<br>
      Other index raise an error.
      @param count - the number of chars to remove<br> 
      if count > length() - index, count is set to length() - index, and a error raised.
      */
    void remove(unsigned int index, unsigned int count);

    // remove the last 'count' chars
    // 0 to length() is valid for count,
    // count >= length() clears the SafeString
    // count > length() set the error flag
    /**
      remove the last count chars
      @param count - the number of chars to remove<br>
      0 to length() is valid for count<br>
      count >= length() clears the SafeString<br>
      count > length() raises and error
      */
    void removeLast(unsigned int count);

    // keep last 'count' number of chars remove the rest
    // 0 to length() is valid for count, passing in count == 0 clears the SafeString
    // count > length() sets error flag and returns SafeString unchanged
    /**
      keep the last count chars and remove the rest
      @param count - the number of chars to keep<br>
      0 to length() is valid for count<br>
      count == 0 clears the SafeString<br>
      count > length() raises and error and leaves the SafeString unchanged
      */
    void keepLast(unsigned int count);


    /* *** change case ************/
    /**
      convert this SafeString to all lower case
      */
    void toLowerCase(void);
    /**
      convert this SafeString to all lower case
      */
    void toUpperCase(void);

    /* *** remove white space from front and back of SafeString ************/
    // the method isspace( ) is used to.  For the 'C' local the following are trimmed
    //    ' '     (0x20)  space (SPC)
    //    '\t'  (0x09)  horizontal tab (TAB)
    //    '\n'  (0x0a)  newline (LF)
    //    '\v'  (0x0b)  vertical tab (VT)
    //    '\f'  (0x0c)  feed (FF)
    //    '\r'  (0x0d)  carriage return (CR)
    /**
      remove all white space from the front and back of this SafeString.
      
      The C method isspace() is used. For the 'C' local the following are trimmed<br>
        ' '     (0x20)  space (SPC)<br>
        '\\t'  (0x09)  horizontal tab (TAB)<br>
        '\\n'  (0x0a)  newline (LF)<br>
        '\\v'  (0x0b)  vertical tab (VT)<br>
        '\\f'  (0x0c)  feed (FF)<br>
        '\\r'  (0x0d)  carriage return (CR)<br>
      */
    void trim(void); // trims front and back

    // processBackspaces recursively remove backspaces, '\b' and the preceeding char
    // use for processing inputs from terminal (Telent) connections
    /**
      recursively remove backspaces, '\\b' and the preceeding char.
      
