satspares/ldmos_design_with_dwin_display/ATmega4808-2026/ATmega4808/lib/SafeStringIO/src/SafeString.h
      useful for processing inputs from terminal (Telent) connections
      */
    void processBackspaces(void);

    /* *** numgber parsing/conversion ************/
    // convert numbers
    // If the SafeString is a valid number update the argument with the result
    // else leave the argument unchanged
    // SafeString conversions are stricter than the Arduino String version
    // trailing chars can only be white space
    /**
      convert the SafeString to an int.
      @param i -- int reference, where the result is stored. i is only updated if the conversion is successful
      @return -- 0 if the SafeString is not a valid int, else return non-zero<br>
        leading and trailing white space is allowed around a valid int
     */         
    unsigned char toInt(int & i) ;
    
    /**
      convert the SafeString to a int64_t (for time_t long long).
      @param l -- int64_t reference, where the result is stored. l is only updated if the conversion is successful
      @return -- 0 if the SafeString is not a valid int, else return non-zero<br>
        leading and trailing white space is allowed around a valid int
     */         
    unsigned char toInt64_t(int64_t &l) ;
    
    /**
      convert the SafeString to a long.
      @param l -- long reference, where the result is stored. l is only updated if the conversion is successful
      @return -- 0 if the SafeString is not a valid int, else return non-zero<br>
        leading and trailing white space is allowed around a valid int
     */         
    unsigned char toLong(long & l) ;

    /**
      convert the SafeString to a long assuming the SafeString in binary (0/1).
      @param l -- long reference, where the result is stored. l is only updated if the conversion is successful
      @return -- 0 if the SafeString is not a valid int, else return non-zero<br>
        leading and trailing white space is allowed around a valid int
     */         
    unsigned char binToLong(long & l) ;
    /**
      convert the SafeString to a long assuming the SafeString in octal (0 to 7).
      @param l -- long reference, where the result is stored. l is only updated if the conversion is successful
      @return -- 0 if the SafeString is not a valid int, else return non-zero<br>
        leading and trailing white space is allowed around a valid int
     */         
    unsigned char octToLong(long & l) ;
    /**
      convert the SafeString to a long assuming the SafeString in HEX (0 to f or 0 to F).
      @param l -- long reference, where the result is stored. l is only updated if the conversion is successful
      @return -- 0 if the SafeString is not a valid int, else return non-zero<br>
        leading and trailing white space is allowed around a valid int
     */         
    unsigned char hexToLong(long & l) ;
    /**
      convert the SafeString to an unsigned long.
      @param l -- long reference, where the result is stored. l is only updated if the conversion is successful
      @return -- 0 if the SafeString is not a valid int, else return non-zero<br>
        leading and trailing white space is allowed around a valid int
     */         
    unsigned char toUnsignedLong(unsigned long & l) ;
    /**
      convert the SafeString to an unsigned long assuming the SafeString in binary (0/1).
      @param l -- unsigned long reference, where the result is stored. l is only updated if the conversion is successful
      @return -- 0 if the SafeString is not a valid int, else return non-zero<br>
        leading and trailing white space is allowed around a valid int
     */         
    unsigned char binToUnsignedLong(unsigned long & l) ;
    /**
      convert the SafeString to an unsigned long assuming the SafeString in octal (0 to 7).
      @param l -- unsigned long reference, where the result is stored. l is only updated if the conversion is successful
      @return -- 0 if the SafeString is not a valid int, else return non-zero<br>
        leading and trailing white space is allowed around a valid int
     */         
    unsigned char octToUnsignedLong(unsigned long & l) ;
    /**
      convert the SafeString to an unsigned long assuming the SafeString in HEX (0 to f or 0 to F).
      @param l -- unsigned long reference, where the result is stored. l is only updated if the conversion is successful
      @return -- 0 if the SafeString is not a valid int, else return non-zero<br>
        leading and trailing white space is allowed around a valid int
     */         
    unsigned char hexToUnsignedLong(unsigned long & l) ;
    /**
      convert the SafeString to a float assuming the SafeString in the decimal format (not scientific)
      @param f -- float reference, where the result is stored. l is only updated if the conversion is successful
      @return -- 0 if the SafeString is not a valid int, else return non-zero<br>
        leading and trailing white space is allowed around a valid int
     */          
    unsigned char toFloat(float  & f) ;
    /**
      convert the SafeString to a float assuming the SafeString in the decimal format (not scientific)
      @param d -- double reference, where the result is stored. l is only updated if the conversion is successful
      @return -- 0 if the SafeString is not a valid int, else return non-zero<br>
        leading and trailing white space is allowed around a valid int
     */          
    unsigned char toDouble(double & d) ;

    // float toFloat(); possible alternative

    /* Tokenizeing methods,  stoken(), nextToken()/firstToken() ************************/
    /* Differences between stoken() and nextToken
       stoken() leaves the SafeString unchanged, nextToken() removes the token (and leading delimiters) from the SafeString giving space to add more input
       In stoken() the end of the SafeString is always treated as a delimiter, i.e. the last token is returned even if it is not followed by one of the delimiters
       In nextToken() the end of the SafeString is a delimiter by default, but setting returnLastNonDelimitedToken =  false will leave last token that is not terminated in the SafeString
       Setting returnLastNonDelimitedToken = false this allows partial tokens to be read from a Stream and kept until the full token and delimiter is read
    */
    /*
         stoken  -- The SafeString itself is not changed
         stoken breaks into the SafeString into tokens using chars in delimiters string and the end of the SafeString as delimiters.
         Any leading delimiters are first stepped over and then the delimited token is return in the token argument (less the delimiter).
         The token argument is always cleared at the start of the stoken().
         if there are any argument errors or the token does not have the capacity to hold the substring, hasError() is set on both this SafeString and the token SafeString

         params
         token - the SafeString to return the token in, it is cleared if no delimited token found or if there are errors
                 The found delimited token (less the delimiter) is returned in the token SafeString argument if there is capacity.
                 The token's capacity should be >= this SafeString's capacity incase the entire SafeString needs to be returned.
                 If the token's capacity is < the next token, then token is returned empty and an error messages printed if debug is enabled.
                 In this case the return (nextIndex) is still updated.
         fromIndex -- where to start the search from  0 to length() and -1 is valid for fromIndex,  -1 => length() for processing
         delimiters - the characters that any one of which can delimit a token. The end of the SafeString is always a delimiter.
         returnEmptyFields -- default false, if true only skip one leading delimiter after each call. If the fromIndex is 0 and there is a delimiter at the beginning of the SafeString, an empty token will be returned
         useAsDelimiters - default true, if false then token consists only of chars in the delimiters and any other char terminates the token

         return -- nextIndex, the next index in this SafeString after the end of the token just found, -1 if this is the last token
                  Use this as the fromIndex for the next call
                  NOTE: if there are no delimiters then -1 is returned and the whole SafeString returned in token if the SafeString token argument is large enough
                  If the token's capacity is < the next token, the token returned is empty and an error messages printed if debug is enabled.
                  In this case the returned nextIndex is still updated to end of the token just found so that that the program will not be stuck in an infinite loop testing for nextIndex >=0
                  while being consistent with the SafeString's all or nothing insertion rule

         Input argument errors return -1 and an empty token and hasError() is set on both this SafeString and the token SafeString.
    **/

    /**
         break into the SafeString into tokens using the char delimiter, the end of the SafeString is always a delimiter
         
         Any leading delimiters are first stepped over and then the delimited token is return in the token argument (less the delimiter).<br>
         The token argument is always cleared at the start of the stoken().<br>
         if there are any argument errors or the token does not have the capacity to hold the substring, hasError() is set on both this SafeString and the token SafeString<br>

         @param token - the SafeString to return the token in, it is cleared if no delimited token found or if there are errors<br>
                 The found delimited token (less the delimiter) is returned in the token SafeString argument if there is capacity.<br>
                 The token's capacity should be >= this SafeString's capacity incase the entire SafeString needs to be returned.<br>
                 If the token's capacity is < the next token, then token is returned empty and an error messages printed if debug is enabled.<br>
                 in this case the return (nextIndex) is still updated.<br>
         @param fromIndex - where to start the search from  0 to length() and -1 is valid for fromIndex,  -1 => length() for processing
         @param delimiter - the char that delimits a token. The end of the SafeString is always a delimiter.
         @param returnEmptyFields - default false, if true only skip one leading delimiter after each call.<br>
             If the fromIndex is 0 and there is a delimiter at the beginning of the SafeString, an empty token will be returned
         @param useAsDelimiters - default true, if false then token will consists of only chars in the delimiters and any other char terminates the token

         @return - nextIndex, the next index in this SafeString after the end of the token just found, -1 if this is the last token<br>
                  Use this as the fromIndex for the next call<br>
                  NOTE: if there are no delimiters then -1 is returned and the whole SafeString returned in token if the SafeString token argument is large enough<br>
                  If the token's capacity is < the next token, the token returned is empty and an error messages printed if debug is enabled.<br>
                  In this case the returned nextIndex is still updated to end of the token just found so that that the program will not be stuck in an infinite loop testing for nextIndex >=0<br>
                  while being consistent with the SafeString's all or nothing insertion rule<br>
                  Input argument errors return -1 and an empty token and hasError() is set on both this SafeString and the token SafeString.
    **/
    int stoken(SafeString & token, unsigned int fromIndex, const char delimiter, bool returnEmptyFields = false, bool useAsDelimiters = true);

    /**
         break into the SafeString into tokens using the delimiters, the end of the SafeString is always a delimiter
         
         Any leading delimiters are first stepped over and then the delimited token is return in the token argument (less the delimiter).<br>
         The token argument is always cleared at the start of the stoken().<br>
         if there are any argument errors or the token does not have the capacity to hold the substring, hasError() is set on both this SafeString and the token SafeString<br>

         @param token - the SafeString to return the token in, it is cleared if no delimited token found or if there are errors<br>
                 The found delimited token (less the delimiter) is returned in the token SafeString argument if there is capacity.<br>
                 The token's capacity should be >= this SafeString's capacity incase the entire SafeString needs to be returned.<br>
                 If the token's capacity is < the next token, then token is returned empty and an error messages printed if debug is enabled.<br>
                 in this case the return (nextIndex) is still updated.<br>
         @param fromIndex - where to start the search from  0 to length() and -1 is valid for fromIndex,  -1 => length() for processing
         @param delimiters - the string containing the characters that any one of which can delimit a token. The end of the SafeString is always a delimiter.
         @param returnEmptyFields - default false, if true only skip one leading delimiter after each call.<br>
             If the fromIndex is 0 and there is a delimiter at the beginning of the SafeString, an empty token will be returned
         @param useAsDelimiters - default true, if false then token will consists of only chars in the delimiters and any other char terminates the token

         @return - nextIndex, the next index in this SafeString after the end of the token just found, -1 if this is the last token<br>
                  Use this as the fromIndex for the next call<br>
                  NOTE: if there are no delimiters then -1 is returned and the whole SafeString returned in token if the SafeString token argument is large enough<br>
                  If the token's capacity is < the next token, the token returned is empty and an error messages printed if debug is enabled.<br>
                  In this case the returned nextIndex is still updated to end of the token just found so that that the program will not be stuck in an infinite loop testing for nextIndex >=0<br>
                  while being consistent with the SafeString's all or nothing insertion rule<br>
                  Input argument errors return -1 and an empty token and hasError() is set on both this SafeString and the token SafeString.
    **/
    int stoken(SafeString & token, unsigned int fromIndex, const char* delimiters, bool returnEmptyFields = false, bool useAsDelimiters = true);

    /**
         break into the SafeString into tokens using the delimiters, the end of the SafeString is always a delimiter
         
         Any leading delimiters are first stepped over and then the delimited token is return in the token argument (less the delimiter).<br>
         The token argument is always cleared at the start of the stoken().<br>
         if there are any argument errors or the token does not have the capacity to hold the substring, hasError() is set on both this SafeString and the token SafeString<br>

         @param token - the SafeString to return the token in, it is cleared if no delimited token found or if there are errors<br>
                 The found delimited token (less the delimiter) is returned in the token SafeString argument if there is capacity.<br>
                 The token's capacity should be >= this SafeString's capacity incase the entire SafeString needs to be returned.<br>
                 If the token's capacity is < the next token, then token is returned empty and an error messages printed if debug is enabled.<br>
                 in this case the return (nextIndex) is still updated.<br>
         @param fromIndex - where to start the search from  0 to length() and -1 is valid for fromIndex,  -1 => length() for processing
         @param delimiters - the SafeString containing the characters that any one of which can delimit a token. The end of the SafeString is always a delimiter.
         @param returnEmptyFields - default false, if true only skip one leading delimiter after each call.<br>
             If the fromIndex is 0 and there is a delimiter at the beginning of the SafeString, an empty token will be returned
         @param useAsDelimiters - default true, if false then token will consists of only chars in the delimiters and any other char terminates the token

         @return - nextIndex, the next index in this SafeString after the end of the token just found, -1 if this is the last token<br>
                  Use this as the fromIndex for the next call<br>
                  NOTE: if there are no delimiters then -1 is returned and the whole SafeString returned in token if the SafeString token argument is large enough<br>
                  If the token's capacity is < the next token, the token returned is empty and an error messages printed if debug is enabled.<br>
                  In this case the returned nextIndex is still updated to end of the token just found so that that the program will not be stuck in an infinite loop testing for nextIndex >=0<br>
                  while being consistent with the SafeString's all or nothing insertion rule<br>
                  Input argument errors return -1 and an empty token and hasError() is set on both this SafeString and the token SafeString.
    **/
    int stoken(SafeString & token, unsigned int fromIndex, SafeString & delimiters, bool returnEmptyFields = false, bool useAsDelimiters = true);

    /**
      returns true if a delimited token is found, removes the first delimited token from this SafeString and returns it in the token argument<br>
      by default a leading delimiter is stepped over before scanning for a delimited token when nextToken() is called<br>
      this firstToken() method overrides this and returns true and an empty token if the first char is a delimiter
       
      The delimiter is not returned and remains in the SafeString so you can test which delimiter terminated the token, provided this SafeString is not empty!<br>
      The token argument is always cleared at the start of the nexttToken().<br>
      IMPORTANT!! Changed V4.0.4 Now by default un-delimited tokens at the end of the SafeString are returned<br>
      To leave partial un-delimited tokens on the end of the SafeString, set returnLastNonDelimitedToken = false.<br>
      Setting returnLastNonDelimitedToken = false allows the SafeString to hold partial tokens when reading from an input stream one char at a time.<br>
      
      @param token - the SafeString to return the token in, it is always cleared first and will be empty if no delimited token is found or if there are errors<br>
              The token's capacity should be >= this SafeString's capacity incase the entire SafeString needs to be returned.<br>
              If the token's capacity is < the next token, then nextToken() returns true, but the returned token argument is empty and an error messages printed if debug is enabled.<br>
              In this case to next token is still removed from the SafeString so that the program will not be stuck in an infinite loop calling nextToken()
      @param delimiter - the char which can delimit a token
      @param returnLastNonDelimitedToken -- default true, will return last part of SafeString even if not delimited. If set false, will keep it for further input to be added to this SafeString
      NOTE: since the last delimiter is left in the SafeString, you should only use firstToken() for the first call.

