satspares/ldmos_design_with_dwin_display/ATmega4808-2026/ATmega4808/lib/SafeStringIO/src/SafeString.h
       @param  strPtr - pointer char array to read from
       @param  maxCharsToRead -- the maximum chars to read into the SafeString, defaults to ((unsigned int)-1) i.e. max unsigned int.
	   
       @return - the number of chars read
    **/
    unsigned int readFrom(const char* strPtr, unsigned int maxCharsToRead = ((unsigned int)-1));
    
    /**
       writes from this SafeString, starting from startIdx, into the SafeString output arguement.
       
       The write stops when the end if the calling SafeString is reached or the output is full
       Note: if the output is already full, then nothing will be written and startIdx will be returned unchanged
       
       @param  output - the SafeString to write to
       @param  startIdx - where to start writing from in the calling SafeString, defaults to 0,
                    if startIdx >= length(), nothing written and length() returned

       @return new startIdx for next write
    **/
    unsigned int writeTo(SafeString & output, unsigned int startIdx = 0);

    /* *** NON-blocking reads from Stream ************************/
    
    /**
      reads from the Stream (if chars available) into the SafeString.
      
      The is NON-BLOCKING and returns immediately if nothing available to be read
      Note: if the SafeString is already full, then nothing will be read and false will be returned

      @param - the Stream reference to read from
      @return true if something added to this SafeString, else false
     **/
    unsigned char read(Stream & input);

    /**
      reads chars into this SafeString until either it is full OR a delimiter is read OR there are no more chars available<br>
      returns true if a delimiter found or SafeString is full, else false<br>
      if a delimiter is found it is returned at the end of the SafeString<br>
      Only at most one delimiter is added per call<br>
      Multiple sucessive delimiters require multiple calls to read them

      @param  input - the Stream reference to read from
      @param  delimiter - the char which is the delimieter
      @return true if SafeString is full or a delimiter is read, else false<br>
    **/
    unsigned char readUntil(Stream & input, const char delimiter);
    /**
      reads chars into this SafeString until either it is full OR a delimiter is read OR there are no more chars available<br>
      returns true if a delimiter found or SafeString is full, else false<br>
      if a delimiter is found it is returned at the end of the SafeString<br>
      Only at most one delimiter is added per call<br>
      Multiple sucessive delimiters require multiple calls to read them

      @param  input - the Stream reference to read from
      @param  delimiters - the string containing the characters any one of which can be a delimieter
      @return true if SafeString is full or a delimiter is read, else false<br>
    **/
    unsigned char readUntil(Stream & input, const char* delimiters);
    /**
      reads chars into this SafeString until either it is full OR a delimiter is read OR there are no more chars available<br>
      returns true if a delimiter found or SafeString is full, else false<br>
      if a delimiter is found it is returned at the end of the SafeString<br>
      Only at most one delimiter is added per call<br>
      Multiple sucessive delimiters require multiple calls to read them

      @param  input - the Stream reference to read from
      @param  delimiters - the SafeString containing the characters any one of which can be a delimieter
      @return true if SafeString is full or a delimiter is read, else false<br>
    **/
    unsigned char readUntil(Stream & input, SafeString & delimiters);

    /**
      returns true if a delimited token is found, else false<br>
      ONLY delimited tokens of length less than this SafeString's capacity will return true with a non-empty token.<br>
      Streams of chars that overflow this SafeString's capacity are ignored and return an empty token on the next delimiter<br>
      A timeout can be specified to return the last un-delimited token after chars stop arriving.<br>
      The input read can be echoed back to the input Stream<br>
      You can force a skip to the next delimiter to discard partial tokens<br>
      
      That is this SafeString's capacity should be at least 1 more then the largest expected token.<br>
      If this SafeString OR the SafeString& token return argument is too small to hold the result, the token is returned empty and an error message output if debugging is enabled.<br>
      The delimiter is NOT included in the SafeString& token return.  It will the first char of the this SafeString when readUntilToken returns true<br>
      It is recommended that the capacity of the SafeString& token argument be >= this SafeString's capacity<br>
      Each call to this method removes any leading delimiters so if you need to check the delimiter do it BEFORE the next call to readUntilToken()

      @param input - the Stream reference to read from
      @param token - the SafeString to return the token found if any, this always cleared at the start of this method
      @param delimiter - the char which is the delimieter
      @param skipToDelimiter - a bool reference variable to hold the skipToDelimiter state between calls<br>
      If this is true all chars upto the next delimiter (or timeout) will be discarded and false returned with an empty token
      @param echoInput - defaults to false, pass non-zero (true) to echo the chars read back to the input Stream
      @param timeout_ms - defaults to never timeout, pass a non-zero ms to auto-terminate the last token if no new chars received for that time.

      @return - true if a delimited series of chars found that fit in this SafeString else false<br>
      If this SafeString OR the SafeString& token argument is too small to hold the result, the token is returned empty<br>
      If a delimited token is found that fits in this SafeString but is too large for the token then true is returned and an empty token returned and an error raised on both this SafeString and the token<br>
      The delimiter is NOT included in the SafeString& token return. It will the first char of the this SafeString when readUntilToken returns true
    **/
    unsigned char readUntilToken(Stream & input, SafeString & token, const char delimiter, bool & skipToDelimiter, uint8_t echoInput = false, unsigned long timeout_ms = 0);

    /**
      returns true if a delimited token is found, else false<br>
      ONLY delimited tokens of length less than this SafeString's capacity will return true with a non-empty token.<br>
      Streams of chars that overflow this SafeString's capacity are ignored and return an empty token on the next delimiter<br>
      A timeout can be specified to return the last un-delimited token after chars stop arriving.<br>
      The input read can be echoed back to the input Stream<br>
      You can force a skip to the next delimiter to discard partial tokens<br>
      
      That is this SafeString's capacity should be at least 1 more then the largest expected token.<br>
      If this SafeString OR the SafeString& token return argument is too small to hold the result, the token is returned empty and an error message output if debugging is enabled.<br>
      The delimiter is NOT included in the SafeString& token return.  It will the first char of the this SafeString when readUntilToken returns true<br>
      It is recommended that the capacity of the SafeString& token argument be >= this SafeString's capacity<br>
      Each call to this method removes any leading delimiters so if you need to check the delimiter do it BEFORE the next call to readUntilToken()

      @param input - the Stream reference to read from
      @param token - the SafeString to return the token found if any, this always cleared at the start of this method
      @param delimiters - the string containing the characters any one of which can be a delimieter
      @param skipToDelimiter - a bool reference variable to hold the skipToDelimiter state between calls<br>
      If this is true all chars upto the next delimiter (or timeout) will be discarded and false returned with an empty token
      @param echoInput - defaults to false, pass non-zero (true) to echo the chars read back to the input Stream
      @param timeout_ms - defaults to never timeout, pass a non-zero ms to auto-terminate the last token if no new chars received for that time.

      @return - true if a delimited series of chars found that fit in this SafeString else false<br>
      If this SafeString OR the SafeString& token argument is too small to hold the result, the token is returned empty<br>
      If a delimited token is found that fits in this SafeString but is too large for the token then true is returned and an empty token returned and an error raised on both this SafeString and the token<br>
      The delimiter is NOT included in the SafeString& token return. It will the first char of the this SafeString when readUntilToken returns true
    **/
    unsigned char readUntilToken(Stream & input, SafeString & token, const char* delimiters, bool & skipToDelimiter, uint8_t echoInput = false, unsigned long timeout_ms = 0);

    /**
      returns true if a delimited token is found, else false<br>
      ONLY delimited tokens of length less than this SafeString's capacity will return true with a non-empty token.<br>
      Streams of chars that overflow this SafeString's capacity are ignored and return an empty token on the next delimiter<br>
      A timeout can be specified to return the last un-delimited token after chars stop arriving.<br>
      The input read can be echoed back to the input Stream<br>
      You can force a skip to the next delimiter to discard partial tokens<br>
      
      That is this SafeString's capacity should be at least 1 more then the largest expected token.<br>
      If this SafeString OR the SafeString& token return argument is too small to hold the result, the token is returned empty and an error message output if debugging is enabled.<br>
      The delimiter is NOT included in the SafeString& token return.  It will the first char of the this SafeString when readUntilToken returns true<br>
      It is recommended that the capacity of the SafeString& token argument be >= this SafeString's capacity<br>
      Each call to this method removes any leading delimiters so if you need to check the delimiter do it BEFORE the next call to readUntilToken()

      @param input - the Stream reference to read from
      @param token - the SafeString to return the token found if any, this always cleared at the start of this method
      @param delimiters - the SafeString containing the characters any one of which can be a delimieter
      @param skipToDelimiter - a bool reference variable to hold the skipToDelimiter state between calls<br>
      If this is true all chars upto the next delimiter (or timeout) will be discarded and false returned with an empty token
      @param echoInput - defaults to false, pass non-zero (true) to echo the chars read back to the input Stream
      @param timeout_ms - defaults to never timeout, pass a non-zero ms to auto-terminate the last token if no new chars received for that time.

      @return - true if a delimited series of chars found that fit in this SafeString else false<br>
      If this SafeString OR the SafeString& token argument is too small to hold the result, the token is returned empty<br>
      If a delimited token is found that fits in this SafeString but is too large for the token then true is returned and an empty token returned and an error raised on both this SafeString and the token<br>
      The delimiter is NOT included in the SafeString& token return. It will the first char of the this SafeString when readUntilToken returns true
    **/
    unsigned char readUntilToken(Stream & input, SafeString & token, SafeString & delimiters, bool & skipToDelimiter, uint8_t echoInput = false, unsigned long timeout_ms = 0);

    /**
      returns the number of chars read on previous calls to read, readUntil or readUntilToken (includes '\0' read if any).
      
      Each call read, readUntil, readUntilToken first clears this count
      @returns - the char count read since the last call to this method.
      */
    size_t getLastReadCount(); 
    
    /* *** END OF PUBLIC METHODS ************/

  protected:
    static Print* debugPtr;
    static bool fullDebug;
    char *buffer;          // the actual char array
    size_t _capacity; // the array length minus one (for the '\0')
    size_t len;       // the SafeString length (not counting the '\0')

    class noDebugPrint : public Print {
      public:
        inline size_t write(uint8_t b) {
          (void)(b);
          return 0;
        }
        inline size_t write(const uint8_t *buffer, size_t length) {
          (void)(buffer);
          (void)(length);
          return 0;
        };
        void flush() { }
    };

    static SafeString::noDebugPrint emptyPrint;

    static Print* currentOutput;// = &emptyPrint;

